# RibbonItemData Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemData Class
Members See Also
---
Base class used to contain information necessary to construct a RibbonItem in the Ribbon.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class RibbonItemData
```

Visual Basic
---
```text
Public Class RibbonItemData
```

Visual C++
---
```text
public ref class RibbonItemData
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.UI..::..RibbonItemData Autodesk.Revit.UI..::..ButtonData Autodesk.Revit.UI..::..ComboBoxData Autodesk.Revit.UI..::..ComboBoxMemberData Autodesk.Revit.UI..::..RadioButtonGroupData Autodesk.Revit.UI..::..TextBoxData
# See Also
RibbonItemData Members
Autodesk.Revit.UI Namespace